{
    "definitions": {
        "usStateCodeType": {
            "type": "string",
            "description": "A state, commonwealth, province, or other such geopolitical subdivision of the United States of America. AA - Armed Forces Americas (except Canada). AE - Armed Forces Africa, Canada, Europe, Middle East. AK - ALASKA. AL - ALABAMA. AP - Armed Forces Pacific. AR - ARKANSAS. AS - AMERICAN SAMOA. AZ - ARIZONA . CA - CALIFORNIA. CO - COLORADO. CT - CONNECTICUT. DC - DISTRICT OF COLUMBIA. DE - DELAWARE. FL - FLORIDA. FM - FEDERATED STATES OF MICRONESIA. GA - GEORGIA. GU - GUAM. HI - HAWAII. IA - IOWA. ID - IDAHO. IL - ILLINOIS. IN - INDIANA. KS - KANSAS. KY - KENTUCKY. LA - LOUISIANA. MA - MASSACHUSETTS. MD - MARYLAND. ME - MAINE. MH - MARSHALL ISLANDS. MI - MICHIGAN. MN - MINNESOTA. MO - MISSOURI. MP - NORTHERN MARIANA ISLANDS. MS - MISSISSIPPI. MT - MONTANA. NC - NORTH CAROLINA. ND - NORTH DAKOTA. NE - NEBRASKA. NH - NEW HAMPSHIRE. NJ - NEW JERSEY. NM - NEW MEXICO. NV - NEVADA. NY - NEW YORK. OH - OHIO. OK - OKLAHOMA. OR - OREGON. PA - PENNSYLVANIA. PR - PUERTO RICO. PW - PALAU. RI - RHODE ISLAND. SC - SOUTH CAROLINA. SD - SOUTH DAKOTA. TN - TENNESSEE. TX - TEXAS. UT - UTAH. VA - VIRGINIA . VI - VIRGIN ISLANDS. VT - VERMONT. WA - WASHINGTON. WI - WISCONSIN. WV - WEST VIRGINIA. WY - WYOMING. ",
            "enum": [
                "AA",
                "AE",
                "AK",
                "AL",
                "AP",
                "AR",
                "AS",
                "AZ",
                "CA",
                "CO",
                "CT",
                "DC",
                "DE",
                "FL",
                "FM",
                "GA",
                "GU",
                "HI",
                "IA",
                "ID",
                "IL",
                "IN",
                "KS",
                "KY",
                "LA",
                "MA",
                "MD",
                "ME",
                "MH",
                "MI",
                "MN",
                "MO",
                "MP",
                "MS",
                "MT",
                "NC",
                "ND",
                "NE",
                "NH",
                "NJ",
                "NM",
                "NV",
                "NY",
                "OH",
                "OK",
                "OR",
                "PA",
                "PR",
                "PW",
                "RI",
                "SC",
                "SD",
                "TN",
                "TX",
                "UT",
                "VA",
                "VI",
                "VT",
                "WA",
                "WI",
                "WV",
                "WY"
            ]
        }
    }
}